Бух_тест/src/DocumentJournals/БанковскиеВыписки/БанковскиеВыписки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>БанковскиеВыписки</name>
  <registeredDocuments>Document.ПоступлениеНаРасчетныйСчет</registeredDocuments>
  <registeredDocuments>Document.СписаниеСРасчетногоСчета</registeredDocuments>
  <registeredDocuments>Document.ПлатежныйОрдерПоступлениеДенежныхСредств</registeredDocuments>
  <registeredDocuments>Document.ПлатежныйОрдерСписаниеДенежныхСредств</registeredDocuments>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>БанковскийСчет</name>
  </columns>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>Поступление</name>
  </columns>
  <columns>
    <name>Списание</name>
  </columns>
  <columns>
    <name>Валюта</name>
  </columns>
  <columns>
    <name>ВидОперации</name>
  </columns>
  <columns>
    <name>ДатаВходящегоДокумента</name>
  </columns>
  <columns>
    <name>НомерВходящегоДокумента</name>
  </columns>
  <columns>
    <name>РучнаяКорректировка</name>
  </columns>
  <columns>
    <name>НазначениеПлатежа</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
</mdclass:DocumentJournal>

Бух_тест/src/Documents/ПлатежныйОрдерПоступлениеДенежныхСредств/ПлатежныйОрдерПоступлениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежныйОрдерПоступлениеДенежныхСредств</name>
  <comment>(Общ)</comment>
  <registerRecords>AccumulationRegister.ПродажиНалоговыйУчет</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПродаж</registerRecords>
  <registerRecords>AccumulationRegister.КнигаДоходовРасходовПоЕдиномуНалогу</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОжидаемыйИПодтвержденныйНДСПриобретений</registerRecords>
  <registerRecords>AccumulationRegister.ПриобретенияНалоговыйУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <comment>(Общ) Банковский счет организации</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБанк</name>
    <comment>(бух)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <comment>(Общ) Банковский счет контрагента</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентом</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт1</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт2</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт3</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПокупкаПродажаВалюты</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыписки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоЕдиномуНалогу</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеПриПрочемПоступлении</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеПлатежныеКартыУслуги</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоЕдиномуНалогуОплатаУслугБанка</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ГТДИмпорт</types>
        <types>DocumentRef.СписаниеСРасчетногоСчета</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПоступлениеНМА</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
        <types>DocumentRef.ПередачаТоваров</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.ПередачаНМА</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>(Общ) Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаРасчетовСКонтрагентом</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаРасчетовПоАвансам</name>
      <comment>(Регл)</comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаТару</name>
      <comment>(Общ)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДекларацииПоЕдиномуНалогу</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПередачиОС</name>
      <comment>(Регл)</comment>
      <type>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.ПодготовкаКПередачеОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстаточнаяСтоимостьОС</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДС</name>
      <comment>(Регл) </comment>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчетаНДСПодтвержденный</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетовСФСС</name>
      <type>
        <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
      </type>
    </attributes>
    <attributes>
      <name>Амортизируется</name>
      <comment>Поставка Основных фондов. Используется для запонения Приложения 5 к Декларации по НДС (с 2008 г) только для приобретения</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСПропорциональноКредит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратАвансаДо01042011НУ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяПоВозвратуАвансаДо2011НУ</name>
      <type>
        <types>CatalogRef.СтатьиДоходов</types>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВДВРПоАвансуДо01042011</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыКонтрагента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бух_тест/src/DocumentJournals/БанковскиеВыписки/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru='Реестр банковских документов';uk='Реєстр банківських документів'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;
	
	ПолеЗапросаСумма =
	"	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)
	|		 	  ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПлатежныйОрдерПоступлениеДенежныхСредств)
	|			ТОГДА Таб.Поступление
	|		КОГДА ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.СписаниеСРасчетногоСчета)
	|		 	  ИЛИ ТИПЗНАЧЕНИЯ(Таб.Ссылка) = ТИП(Документ.ПлатежныйОрдерСписаниеДенежныхСредств)
	|			ТОГДА Таб.Списание
	|		ИНАЧЕ 0
	|	КОНЕЦ";
	
	ПолеЗапросаНазначениеПлатежа =
	"ВЫБОР
	|		КОГДА Таб.НазначениеПлатежа ПОДОБНО """"
	|			ТОГДА ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))
	|		ИНАЧЕ """" + (ВЫРАЗИТЬ(Таб.Контрагент.Наименование КАК СТРОКА(100))) + "" / "" + (ВЫРАЗИТЬ(Таб.НазначениеПлатежа КАК СТРОКА(160)))
	|	КОНЕЦ";
	
	Результат.Вставить("НомерВходящегоДокумента", "НомерВходящегоДокумента");
	Результат.Вставить("ДатаВходящегоДокумента",  "ДатаВходящегоДокумента");
	Результат.Вставить("Информация",      ПолеЗапросаНазначениеПлатежа);
	Результат.Вставить("СуммаДокумента",  ПолеЗапросаСумма);
	Результат.Вставить("ВалютаДокумента", "Валюта");
	
	Возврат Результат;
	
КонецФункции
